Documents/ОтгрузкаЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ОтгрузкаЗаказов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаказов</xr:Item>
				<xr:Item>InformationRegister.ИсторияОтгрузок</xr:Item>
				<xr:Item>AccumulationRegister.Отгрузки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>_Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомашина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Накладные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Накладная</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отгрузить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Отгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Отгрузки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ИсторияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияЗаказов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказАгента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принятый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатываемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгруженный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставленный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмененный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаленный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичныйВозврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолныйВозврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Супервайзер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомашина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОтгрузкаЗаказов/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Неопределено") ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДатаНачала = ТекущаяДата();
		Склад = ПараметрыСеанса.Пользователь.Склад;
		Водитель = Справочники.Сотрудники.ПустаяСсылка();
		Автомашина = Справочники.ТранспортныеСредства.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Отгрузки.Записывать = Истина;
	Движения.ИсторияЗаказов.Записывать = Истина;
	
	Для Каждого Строка Из Накладные Цикл
		Если ЗначениеЗаполнено(Строка.Накладная) = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.Накладная.Дата > Дата Тогда
			Сообщить("Дата реализации (" + СокрЛП(Строка.Накладная) + ") не может быть позднее даты отгрузки (" + СокрЛП(Ссылка) + ").");
			
			Отказ = Истина;
		КонецЕсли;
		
		Если Водитель <> Доставщик Тогда
		 	Движение = Движения.Отгрузки.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = Водитель;
			Движение.Примечание = глНайтиПримечания(Комментарий);
			Движение.Сумма = Строка.Накладная.Товары.Итог("СуммаПродажная") / 2;
			
		 	Движение = Движения.Отгрузки.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = Доставщик;
			Движение.Примечание = глНайтиПримечания(Комментарий);
			Движение.Сумма = Строка.Накладная.Товары.Итог("СуммаПродажная") / 2;
		Иначе
		 	Движение = Движения.Отгрузки.Добавить();
			Движение.Период = Дата;
			Движение.Сотрудник = Доставщик;
			Движение.Примечание = глНайтиПримечания(Комментарий);
			Движение.Сумма = Строка.Накладная.Товары.Итог("СуммаПродажная");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Накладная.Заказ) Тогда
			Запись = Движения.ИсторияЗаказов.Добавить();
			Запись.Период = Макс(Дата, Строка.Накладная.Дата, Строка.Накладная.Заказ.Дата);
			Запись.Заказ = Строка.Накладная.Заказ;
			Если Статус = Перечисления.СтатусыОтгрузки.Оформлен Тогда
				Запись.Статус = Перечисления.СтатусыЗаказа.Обрабатываемый;
			ИначеЕсли Статус = Перечисления.СтатусыОтгрузки.Отгружен Тогда
				Запись.Статус = Перечисления.СтатусыЗаказа.Отгруженный;
			ИначеЕсли Статус = Перечисления.СтатусыОтгрузки.Доставлен Тогда
				Запись.Статус = Перечисления.СтатусыЗаказа.Доставленный;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Открепление отгрузки от накладных
	Выборка = Документы.РеализацияТМЦ.Выбрать(,,Новый Структура("Отгрузка", Ссылка));
	Пока Выборка.Следующий() Цикл
		Строка = Накладные.Найти(Выборка.Ссылка, "Накладная");
		Если Строка = Неопределено ИЛИ Строка.Отгрузить = Ложь Тогда
			НакладнаяОбъект = Выборка.ПолучитьОбъект();
			НакладнаяОбъект.Отгрузка = Неопределено;
			НакладнаяОбъект.Записать(?(НакладнаяОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из Накладные Цикл
		// Прикрепление отгрузки к накладным
		Если глСсылкаСуществует(Строка.Накладная) Тогда
			Если Строка.Накладная.Отгрузка <> Ссылка Тогда
				НакладнаяОбъект = Строка.Накладная.ПолучитьОбъект();
				НакладнаяОбъект.Отгрузка = Ссылка;
				НакладнаяОбъект.Записать(?(НакладнаяОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Запрос = Новый Запрос("
	//	|ВЫБРАТЬ
	//	|	КассоваяОперация.Ссылка КАК Ссылка,
	//	|	КассоваяОперация.Дата КАК Дата
	//	|ИЗ
	//	|	Документ.КассоваяОперация КАК КассоваяОперация
	//	|ГДЕ
	//	|	КассоваяОперация.Основание = &Основание
	//	|"
	//);
	//
	//Запрос.УстановитьПараметр("Основание", Ссылка);
	//
	//ВыборкаКассоваяОперация = Запрос.Выполнить().Выбрать();
	//Пока ВыборкаКассоваяОперация.Следующий() Цикл
	//	Если ВыборкаКассоваяОперация.Дата < Дата Тогда
	//		Сообщить("Дата отгрузки (" + СокрЛП(Ссылка) + ") не может быть позднее даты кассовой операции (" + СокрЛП(ВыборкаКассоваяОперация.Ссылка) + ").");
	//		
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачала) = Ложь Тогда
		ДатаНачала = Дата;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Статус = Перечисления.СтатусыОтгрузки.Отменен;
	ИначеЕсли Статус = Перечисления.СтатусыОтгрузки.Отменен Тогда
		Статус = Перечисления.СтатусыОтгрузки.Оформлен;
	КонецЕсли;
	
	// TODO
	// Фильтрация таблицы
	Индекс = Накладные.Количество() - 1;
	Пока Индекс >= 0 Цикл 
		Строка = Накладные.Получить(Индекс);
		
		Если Строка.Отгрузить = Ложь Тогда
			Накладные.Удалить(Строка);
		КонецЕсли;
		
		Индекс = Индекс - 1; 
	КонецЦикла;
	
	Для Каждого Строка Из Накладные Цикл
		Строка.Объем = Строка.Накладная.Товары.Итог("Объем");
		Строка.Вес = Строка.Накладная.Товары.Итог("Вес");
	КонецЦикла;
	
	Объем = Накладные.Итог("Объем");
	Вес = Накладные.Итог("Вес");
	Сумма = Накладные.Итог("Сумма");
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Открепление отгрузки от накладных
	Выборка = Документы.РеализацияТМЦ.Выбрать(,,Новый Структура("Отгрузка", Ссылка));
	Пока Выборка.Следующий() Цикл
		НакладнаяОбъект = Выборка.ПолучитьОбъект();
		НакладнаяОбъект.Отгрузка = Неопределено;
		НакладнаяОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПустыеСтроки = Накладные.НайтиСтроки(Новый Структура("Отгрузить", Ложь)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Накладные.Удалить(Строка); 
	КонецЦикла;
	
	//// Фильтрация таблицы
	//Индекс = Накладные.Количество() - 1;
	//Пока Индекс >= 0 Цикл 
	//	Строка = Накладные.Получить(Индекс);
	//	
	//	Если Строка.Отгрузить = Ложь Тогда
	//		Накладные.Удалить(Строка);
	//	КонецЕсли;
	//	
	//	Индекс = Индекс - 1; 
	//КонецЦикла;
	
	Если Накладные.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не отмечена ни одна накладная на отгрузку.";
		Сообщение.Поле = "Накладные";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого Строка Из Накладные Цикл
		Если глСсылкаСуществует(Строка.Накладная) = Ложь Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Накладная не найдена.";
			Сообщение.Поле = "Накладные[" + Строка.НомерСтроки + "].Накладная";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если Строка.Накладная.Проведен = Ложь Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Накладная не проведена.";
			Сообщение.Поле = "Накладные[" + Строка.НомерСтроки + "].Накладная";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если Строка.Накладная.Самовывоз Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Накладная помечена как самовывоз.";
			Сообщение.Поле = "Накладные[" + Строка.НомерСтроки + "].Накладная";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
